---
title: GeneralFailures
classe: Autodesk.Revit.DB.BuiltInFailures+GeneralFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 42
---

# GeneralFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId CannotFixProblem { get; }` | `GeneralFailures.CannotFixProblem` | FailureDefinitionId |
| `FailureDefinitionId CannotSetParameter { get; }` | `GeneralFailures.CannotSetParameter` | FailureDefinitionId |
| `FailureDefinitionId CharactersNotAllowed { get; }` | `GeneralFailures.CharactersNotAllowed` | FailureDefinitionId |
| `FailureDefinitionId ContentDocTreeCorruption { get; }` | `GeneralFailures.ContentDocTreeCorruption` | FailureDefinitionId |
| `FailureDefinitionId ConvertingOldAxisToNormal { get; }` | `GeneralFailures.ConvertingOldAxisToNormal` | FailureDefinitionId |
| `FailureDefinitionId CoreElemTestingError { get; }` | `GeneralFailures.CoreElemTestingError` | FailureDefinitionId |
| `FailureDefinitionId DuplicateValue { get; }` | `GeneralFailures.DuplicateValue` | FailureDefinitionId |
| `FailureDefinitionId EnterNonNegativeValue { get; }` | `GeneralFailures.EnterNonNegativeValue` | FailureDefinitionId |
| `FailureDefinitionId EnterValidRealGreaterThan { get; }` | `GeneralFailures.EnterValidRealGreaterThan` | FailureDefinitionId |
| `FailureDefinitionId EnterValueBetween { get; }` | `GeneralFailures.EnterValueBetween` | FailureDefinitionId |
| `FailureDefinitionId ErrorInFamilyResolved { get; }` | `GeneralFailures.ErrorInFamilyResolved` | FailureDefinitionId |
| `FailureDefinitionId ErrorInSymbolFamilyResolved { get; }` | `GeneralFailures.ErrorInSymbolFamilyResolved` | FailureDefinitionId |
| `FailureDefinitionId ErrorResolved { get; }` | `GeneralFailures.ErrorResolved` | FailureDefinitionId |
| `FailureDefinitionId FailedToOpenFile { get; }` | `GeneralFailures.FailedToOpenFile` | FailureDefinitionId |
| `FailureDefinitionId FailedToReadLine { get; }` | `GeneralFailures.FailedToReadLine` | FailureDefinitionId |
| `FailureDefinitionId FamilySeparationTestingError { get; }` | `GeneralFailures.FamilySeparationTestingError` | FailureDefinitionId |
| `FailureDefinitionId GenericCorruption { get; }` | `GeneralFailures.GenericCorruption` | FailureDefinitionId |
| `FailureDefinitionId GenericError { get; }` | `GeneralFailures.GenericError` | FailureDefinitionId |
| `FailureDefinitionId GenericErrorNone { get; }` | `GeneralFailures.GenericErrorNone` | FailureDefinitionId |
| `FailureDefinitionId GenericFatalError { get; }` | `GeneralFailures.GenericFatalError` | FailureDefinitionId |
| `FailureDefinitionId GenericNonFatalError { get; }` | `GeneralFailures.GenericNonFatalError` | FailureDefinitionId |
| `FailureDefinitionId GenericWarning { get; }` | `GeneralFailures.GenericWarning` | FailureDefinitionId |
| `FailureDefinitionId InaccuracyDetected { get; }` | `GeneralFailures.InaccuracyDetected` | FailureDefinitionId |
| `FailureDefinitionId InternalProblemsParameter { get; }` | `GeneralFailures.InternalProblemsParameter` | FailureDefinitionId |
| `FailureDefinitionId InvalidInput { get; }` | `GeneralFailures.InvalidInput` | FailureDefinitionId |
| `FailureDefinitionId InvalidInputWarn { get; }` | `GeneralFailures.InvalidInputWarn` | FailureDefinitionId |
| `FailureDefinitionId InvalidOrderOfPhases { get; }` | `GeneralFailures.InvalidOrderOfPhases` | FailureDefinitionId |
| `FailureDefinitionId InvalidValue { get; }` | `GeneralFailures.InvalidValue` | FailureDefinitionId |
| `FailureDefinitionId NameInUse { get; }` | `GeneralFailures.NameInUse` | FailureDefinitionId |
| `FailureDefinitionId NameIsEmpty { get; }` | `GeneralFailures.NameIsEmpty` | FailureDefinitionId |
| `FailureDefinitionId NameNotUnique { get; }` | `GeneralFailures.NameNotUnique` | FailureDefinitionId |
| `FailureDefinitionId NoRelatedWarnings { get; }` | `GeneralFailures.NoRelatedWarnings` | FailureDefinitionId |
| `FailureDefinitionId ParameterValueNotInRange { get; }` | `GeneralFailures.ParameterValueNotInRange` | FailureDefinitionId |
| `FailureDefinitionId ParameterValuesConflict { get; }` | `GeneralFailures.ParameterValuesConflict` | FailureDefinitionId |
| `FailureDefinitionId SeriousElementReferenceCorruption { get; }` | `GeneralFailures.SeriousElementReferenceCorruption` | FailureDefinitionId |
| `FailureDefinitionId TransactionFailed { get; }` | `GeneralFailures.TransactionFailed` | FailureDefinitionId |
| `FailureDefinitionId TransactionFailedWarn { get; }` | `GeneralFailures.TransactionFailedWarn` | FailureDefinitionId |
| `FailureDefinitionId UnresolvableErrorInFamily { get; }` | `GeneralFailures.UnresolvableErrorInFamily` | FailureDefinitionId |
| `FailureDefinitionId UnresolvableErrorInFamilyWarn { get; }` | `GeneralFailures.UnresolvableErrorInFamilyWarn` | FailureDefinitionId |
| `FailureDefinitionId UnspecifiedError { get; }` | `GeneralFailures.UnspecifiedError` | FailureDefinitionId |
| `FailureDefinitionId ValueOutOfRange { get; }` | `GeneralFailures.ValueOutOfRange` | FailureDefinitionId |
| `FailureDefinitionId WarningInFamilyDismissed { get; }` | `GeneralFailures.WarningInFamilyDismissed` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```